#Задание 3
#Напишите счетчик с помощью конструкции while, который выводит числа от 0 до 10.
#Напишите счетчик с помощью конструкции while, который выводит числа от 20 до 1.

x = 0
while x < 11:
    print(x)
    x += 1

x = 20
while x > 0:
    print (x)
    x-=1

